starship init fish | source
set -gx COLORTERM truecolor
function fish_greeting
    set_color green
    # Using a single quoted block to prevent character escaping issues
    printf '%s\n' \
'    ,≡~ J▄,                     .▄                             r' \
'     ,▄█p▄▄▌▀█└                  φ▄▓▀█m                          ▀█▀⌐' \
'     ██▌▐██▌ ▌      ,▄    ,,  ,,   ██ ▀      ,▄     φ,      ,▄    ╫      ,▄    ,,  ,,' \
'     ▓██▌J██▌      e▄▌▀██▓⌐º██Mⁿ██▌ ╙██╙T   ╦▄▌▀██ +▄▓╙▀█M  ▄▄D▀█▌  φ█▌─e▄▌▀██▓⌐º██Mⁿ██▌' \
'     ███▌J██▌ ≡, J█▌ ▐█▌  ██  ██` .██    ▐█▌ ▄▀ J██▄,J▄  ██▌,,▄n ▐█▌ J█▌ J█▌  ██  ██`' \
'     J██▌J█▀▀º Jh▐██ J█▌  ██  ██  ,██,    ▐██¿      , J██   ,, ██U ╫█▌ J██uJ█▌  ██  ██' \
'      ▀██▌    ,m``▀▀█M▀╙ ╙██╙"██╜ ª▀█▀╙  ╙▀▀█M  ▄▀█▌4▀▀└φ▀██▌╚▀└`▀█▀ `▀▀█╩▀╙ "██╜"██▀' \
'          ╙╙╙"'
    set_color normal
end
